connorl309/Custom-UC-Board/tmpm46b_v2.3.1/tx03_cmsis_v2.3.1/M46B/TMPM46B/Libraries/TX04_Periph_Driver/src/tmpm46b_udmac.c
    assert_param(IS_DMACA_CHANNEL_ALL(Channel));
    assert_param(IS_DMAC_TRANSFERTYPE(Type));

    if (Type == DMAC_BURST) {
        /* Set DMAxChnlUseburstSet<chnl_useburst_set> to disable the single,
           transfer to the channel, and only burst transfer request is valid */
        tmp = DMAC_UNIT_A->CHNLUSEBURSTSET;
        tmp |= (0x01UL << ((uint32_t) Channel));
        DMAC_UNIT_A->CHNLUSEBURSTSET = tmp;
    } else {
        assert_param(IS_DMACA_CHANNEL_SINGLE(Channel));
        /* Set DMAxChnlUseburstClr<chnl_useburst_clr> to enable the single,
           transfer to the corresponding channel */
        tmp = DMAC_UNIT_A->CHNLUSEBURSTCLR;
        tmp |= (0x01UL << ((uint32_t) Channel));
        DMAC_UNIT_A->CHNLUSEBURSTCLR = tmp;
    }
}

/**
  * @brief  Get transfer type setting for the specified channel of the DMAC UNITA.
  * @param  Channel: Select channel.
  *   This parameter can be one of the following values:
  *   DMACA_SNFC_PRD11,         DMACA_SNFC_PRD12,         DMACA_SNFC_PRD21,                   
  *   DMACA_SNFC_PRD22,         DMACA_ADC_COMPLETION,     DMACA_UART0_RX,  
  *   DMACA_UART0_TX,           DMACA_UART1_RX,           DMACA_UART1_TX,                     
  *   DMACA_SIO0_UART0_RX,      DMACA_SIO0_UART0_TX,      DMACA_SIO1_UART1_RX,                
  *   DMACA_SIO1_UART1_TX,      DMACA_SIO2_UART2_RX,      DMACA_SIO2_UART2_TX,                             
  *   DMACA_SIO3_UART3_RX,      DMACA_SIO3_UART3_TX,      DMACA_TMRB0_CMP_MATCH,
  *   DMACA_TMRB1_CMP_MATCH,    DMACA_TMRB2_CMP_MATCH,    DMACA_TMRB3_CMP_MATCH,
  *   DMACA_TMRB4_CMP_MATCH,    DMACA_TMRB5_CMP_MATCH,    DMACA_TMRB6_CMP_MATCH,
  *   DMACA_TMRB7_CMP_MATCH,    DMACA_TMRB0_INPUT_CAP0,   DMACA_TMRB0_INPUT_CAP1,
  *   DMACA_TMRB1_INPUT_CAP0,   DMACA_TMRB1_INPUT_CAP1,   DMACA_TMRB2_INPUT_CAP0,
  *   DMACA_TMRB2_INPUT_CAP1,   DMACA_DMAREQA    
  * @retval The transfer type.
  *   DMAC_BURST  : Only burst transfer request can be used.
  *   DMAC_SINGLE : Single transfer is enabled.
  */
DMAC_TransferType DMACA_GetTransferType(uint8_t Channel)
{
    uint32_t tmp = 0U;
    DMAC_TransferType Type = DMAC_SINGLE;

    assert_param(IS_DMACA_CHANNEL_ALL(Channel));

    tmp = DMAC_UNIT_A->CHNLUSEBURSTSET & (0x01UL << ((uint32_t) Channel));
    if (tmp != 0U) {
        /* Read DMAxChnlUseburstSet<chnl_useburst_set >, Only burst transfer request can be used */
        Type = DMAC_BURST;
    } else {
        Type = DMAC_SINGLE;
    }
    
    return Type;
}

/**
  * @brief  Set transfer type to the specified channel of DMAC UNITB.
  * @param  Channel: Select channel.
  *   This parameter can be one of the following values:
  *   when Type == DMAC_BURST:
  *   DMACB_SNFC_GIE1,          DMACB_SNFC_GIE2,         DMACB_SNFC_GIE3,  
  *   DMACB_SNFC_GIE4,          DMACB_SNFC_GIE5,         DMACB_SNFC_GIE6,  
  *   DMACB_SNFC_GIE7,          DMACB_SNFC_GIE8,         DMACB_SNFC_GID11, 
  *   DMACB_SNFC_GID12,         DMACB_SNFC_GID13,        DMACB_SNFC_GID14, 
  *   DMACB_SNFC_GID15,         DMACB_SNFC_GID16,        DMACB_SNFC_GID17, 
  *   DMACB_SNFC_GID18,         DMACB_SNFC_GID21,        DMACB_SNFC_GID22, 
  *   DMACB_SNFC_GID23,         DMACB_SNFC_GID24,        DMACB_SNFC_GID25, 
  *   DMACB_SNFC_GID26,         DMACB_SNFC_GID27,        DMACB_SNFC_GID28, 
  *   DMACB_ADC_COMPLETION,     DMACB_SSP0_RX,           DMACB_SSP0_TX,    
  *   DMACB_SSP1_RX,            DMACB_SSP1_TX,           DMACB_SSP2_RX,    
  *   DMACB_SSP2_TX,            DMACB_DMAREQB  
  *  
  *   when Type == DMAC_SINGLE:
  *   DMACB_SSP0_RX, DMACB_SSP0_TX,
  *   DMACB_SSP1_RX, DMACB_SSP1_TX,
  *   DMACB_SSP2_RX, DMACB_SSP2_TX,
  *
  * @param  Type: Select transfer type
  *   This parameter can be one of the following values:
  *   DMAC_BURST  : Single transfer is disabled, only burst transfer request can be used.
  *   DMAC_SINGLE : Single transfer is enabled.
  * @retval None.
  */
void DMACB_SetTransferType(uint8_t Channel, DMAC_TransferType Type)
{
    uint32_t tmp = 0U;

    assert_param(IS_DMACB_CHANNEL_ALL(Channel));
    assert_param(IS_DMAC_TRANSFERTYPE(Type));

    if (Type == DMAC_BURST) {
        /* Set DMAxChnlUseburstSet<chnl_useburst_set> to disable the single,
           transfer to the channel, and only burst transfer request is valid */
        tmp = DMAC_UNIT_B->CHNLUSEBURSTSET;
        tmp |= (0x01UL << ((uint32_t) Channel));
        DMAC_UNIT_B->CHNLUSEBURSTSET = tmp;
    } else {
        assert_param(IS_DMACB_CHANNEL_SINGLE(Channel));
        /* Set DMAxChnlUseburstClr<chnl_useburst_clr> to enable the single,
           transfer to the corresponding channel */
        tmp = DMAC_UNIT_B->CHNLUSEBURSTCLR;
        tmp |= (0x01UL << ((uint32_t) Channel));
        DMAC_UNIT_B->CHNLUSEBURSTCLR = tmp;
    }
}

/**
  * @brief  Get transfer type setting for the specified channel of the DMAC UNITB.
  * @param  Channel: Select channel.
  *   This parameter can be one of the following values:
  *   DMACB_SNFC_GIE1,         DMACB_SNFC_GIE2,         DMACB_SNFC_GIE3,  
  *   DMACB_SNFC_GIE4,         DMACB_SNFC_GIE5,         DMACB_SNFC_GIE6,  
  *   DMACB_SNFC_GIE7,         DMACB_SNFC_GIE8,         DMACB_SNFC_GID11, 
  *   DMACB_SNFC_GID12,        DMACB_SNFC_GID13,        DMACB_SNFC_GID14, 
  *   DMACB_SNFC_GID15,        DMACB_SNFC_GID16,        DMACB_SNFC_GID17, 
  *   DMACB_SNFC_GID18,        DMACB_SNFC_GID21,        DMACB_SNFC_GID22, 
  *   DMACB_SNFC_GID23,        DMACB_SNFC_GID24,        DMACB_SNFC_GID25, 
  *   DMACB_SNFC_GID26,        DMACB_SNFC_GID27,        DMACB_SNFC_GID28, 
  *   DMACB_ADC_COMPLETION,    DMACB_SSP0_RX,           DMACB_SSP0_TX,    
  *   DMACB_SSP1_RX,           DMACB_SSP1_TX,           DMACB_SSP2_RX,    
  *   DMACB_SSP2_TX,           DMACB_DMAREQB 
  * @retval The transfer type.
  *   DMAC_BURST  : Only burst transfer request can be used.
  *   DMAC_SINGLE : Single transfer is enabled.
  */
DMAC_TransferType DMACB_GetTransferType(uint8_t Channel)
{
    uint32_t tmp = 0U;
    DMAC_TransferType Type = DMAC_SINGLE;

