connorl309/Custom-UC-Board/tmpm46b_v2.3.1/tx03_cmsis_v2.3.1/M46B/TMPM46B/Libraries/TX04_Periph_Driver/src/tmpm46b_udmac.c
    assert_param(IS_DMACB_CHANNEL_ALL(Channel));

    tmp = DMAC_UNIT_B->CHNLUSEBURSTSET & (0x01UL << ((uint32_t) Channel));
    if (tmp != 0U) {
        /* Read DMAxChnlUseburstSet<chnl_useburst_set >, Only burst transfer request can be used */
        Type = DMAC_BURST;
    } else {
        Type = DMAC_SINGLE;
    }
    
    return Type;
}

/**
  * @brief  Set mask for the specified channel of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B, DMAC_UNIT_C
  * @param  Channel: Select channel.
  *   This parameter can be one of the following values:
  *   For DMAC_UNIT_A:
  *   DMACA_SNFC_PRD11,         DMACA_SNFC_PRD12,         DMACA_SNFC_PRD21,                   
  *   DMACA_SNFC_PRD22,         DMACA_ADC_COMPLETION,     DMACA_UART0_RX,  
  *   DMACA_UART0_TX,           DMACA_UART1_RX,           DMACA_UART1_TX,                     
  *   DMACA_SIO0_UART0_RX,      DMACA_SIO0_UART0_TX,      DMACA_SIO1_UART1_RX,                
  *   DMACA_SIO1_UART1_TX,      DMACA_SIO2_UART2_RX,      DMACA_SIO2_UART2_TX,                             
  *   DMACA_SIO3_UART3_RX,      DMACA_SIO3_UART3_TX,      DMACA_TMRB0_CMP_MATCH,
  *   DMACA_TMRB1_CMP_MATCH,    DMACA_TMRB2_CMP_MATCH,    DMACA_TMRB3_CMP_MATCH,
  *   DMACA_TMRB4_CMP_MATCH,    DMACA_TMRB5_CMP_MATCH,    DMACA_TMRB6_CMP_MATCH,
  *   DMACA_TMRB7_CMP_MATCH,    DMACA_TMRB0_INPUT_CAP0,   DMACA_TMRB0_INPUT_CAP1,
  *   DMACA_TMRB1_INPUT_CAP0,   DMACA_TMRB1_INPUT_CAP1,   DMACA_TMRB2_INPUT_CAP0,
  *   DMACA_TMRB2_INPUT_CAP1,   DMACA_DMAREQA    
  *
  *   For DMAC_UNIT_B:
  *   DMACB_SNFC_GIE1,          DMACB_SNFC_GIE2,          DMACB_SNFC_GIE3,  
  *   DMACB_SNFC_GIE4,          DMACB_SNFC_GIE5,          DMACB_SNFC_GIE6,  
  *   DMACB_SNFC_GIE7,          DMACB_SNFC_GIE8,          DMACB_SNFC_GID11, 
  *   DMACB_SNFC_GID12,         DMACB_SNFC_GID13,         DMACB_SNFC_GID14, 
  *   DMACB_SNFC_GID15,         DMACB_SNFC_GID16,         DMACB_SNFC_GID17, 
  *   DMACB_SNFC_GID18,         DMACB_SNFC_GID21,         DMACB_SNFC_GID22, 
  *   DMACB_SNFC_GID23,         DMACB_SNFC_GID24,         DMACB_SNFC_GID25, 
  *   DMACB_SNFC_GID26,         DMACB_SNFC_GID27,         DMACB_SNFC_GID28, 
  *   DMACB_ADC_COMPLETION,     DMACB_SSP0_RX,            DMACB_SSP0_TX,    
  *   DMACB_SSP1_RX,            DMACB_SSP1_TX,            DMACB_SSP2_RX,    
  *   DMACB_SSP2_TX,            DMACB_DMAREQB   
  *
  *   For DMAC_UNIT_C:
  *   DMACC_SNFC_RD1,           DMACC_SNFC_RD2,           DMACC_SNFC_RD3,           
  *   DMACC_SNFC_RD4,           DMACC_SNFC_RD5,           DMACC_SNFC_RD6,           
  *   DMACC_SNFC_RD7,           DMACC_SNFC_RD8,           DMACC_AES_READ,           
  *   DMACC_AES_WRITE,          DMACC_SHA_WRITE,          DMACC_DMA_COMPLETION,     
  *   DMACC_I2C0_TX_RX,         DMACC_I2C1_TX_RX,         DMACC_I2C2_TX_RX,        
  *   DMACC_MTP0_CMP_MATCH0,    DMACC_MTP0_CMP_MATCH1,    DMACC_MTP1_CMP_MATCH0,    
  *   DMACC_MTP1_CMP_MATCH1,    DMACC_MTP2_CMP_MATCH0,    DMACC_MTP2_CMP_MATCH1,    
  *   DMACC_MTP3_CMP_MATCH0,    DMACC_MTP3_CMP_MATCH1,    DMACC_TMRB3_INPUT_CAP0,   
  *   DMACC_TMRB3_INPUT_CAP1,   DMACC_TMRB4_INPUT_CAP0,   DMACC_TMRB4_INPUT_CAP1,   
  *   DMACC_TMRB5_INPUT_CAP0,   DMACC_TMRB5_INPUT_CAP1,   DMACC_TMRB6_INPUT_CAP0,   
  *   DMACC_TMRB6_INPUT_CAP1,   DMACC_DMAREQC   
  * @param  NewState: Clear or set the mask to enable or disable the DMA channel
  *   This parameter can be one of the following values:
  *   ENABLE  : The DMA channel mask is cleared, DMA request is enable(valid)
  *   DISABLE : The DMA channel is masked, DMA request is disable(invalid)
  * @retval None
  */
void DMAC_SetMask(TSB_DMA_TypeDef * DMACx, uint8_t Channel, FunctionalState NewState)
{
    uint32_t tmp = 0U;

    assert_param(IS_DMAC_CHANNEL_ALL(DMACx, Channel));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Set DMAxChnlReqMaskClr<chnl_req_mask_clr>, clear mask to enable DMA channel,(valid) */
        tmp = DMACx->CHNLREQMASKCLR;
        tmp |= (0x01UL << ((uint32_t) Channel));
        DMACx->CHNLREQMASKCLR = tmp;
    } else {
        /* Set DMAxChnlReqMaskSet<chnl_req_mask_set>, set mask to disable DMA channel,(invalid) */
        tmp = DMACx->CHNLREQMASKSET;
        tmp |= (0x01UL << ((uint32_t) Channel));
        DMACx->CHNLREQMASKSET = tmp;
    }
}

/**
  * @brief  Get mask setting for the specified channel of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B, DMAC_UNIT_C
  * @param  Channel: Select channel.
  *   This parameter can be one of the following values:
  *   For DMAC_UNIT_A:
  *   DMACA_SNFC_PRD11,         DMACA_SNFC_PRD12,         DMACA_SNFC_PRD21,                   
  *   DMACA_SNFC_PRD22,         DMACA_ADC_COMPLETION,     DMACA_UART0_RX,  
  *   DMACA_UART0_TX,           DMACA_UART1_RX,           DMACA_UART1_TX,                     
  *   DMACA_SIO0_UART0_RX,      DMACA_SIO0_UART0_TX,      DMACA_SIO1_UART1_RX,                
  *   DMACA_SIO1_UART1_TX,      DMACA_SIO2_UART2_RX,      DMACA_SIO2_UART2_TX,                             
  *   DMACA_SIO3_UART3_RX,      DMACA_SIO3_UART3_TX,      DMACA_TMRB0_CMP_MATCH,
  *   DMACA_TMRB1_CMP_MATCH,    DMACA_TMRB2_CMP_MATCH,    DMACA_TMRB3_CMP_MATCH,
  *   DMACA_TMRB4_CMP_MATCH,    DMACA_TMRB5_CMP_MATCH,    DMACA_TMRB6_CMP_MATCH,
  *   DMACA_TMRB7_CMP_MATCH,    DMACA_TMRB0_INPUT_CAP0,   DMACA_TMRB0_INPUT_CAP1,
  *   DMACA_TMRB1_INPUT_CAP0,   DMACA_TMRB1_INPUT_CAP1,   DMACA_TMRB2_INPUT_CAP0,
  *   DMACA_TMRB2_INPUT_CAP1,   DMACA_DMAREQA    
  *
  *   For DMAC_UNIT_B:
  *   DMACB_SNFC_GIE1,          DMACB_SNFC_GIE2,          DMACB_SNFC_GIE3,  
  *   DMACB_SNFC_GIE4,          DMACB_SNFC_GIE5,          DMACB_SNFC_GIE6,  
  *   DMACB_SNFC_GIE7,          DMACB_SNFC_GIE8,          DMACB_SNFC_GID11, 
  *   DMACB_SNFC_GID12,         DMACB_SNFC_GID13,         DMACB_SNFC_GID14, 
  *   DMACB_SNFC_GID15,         DMACB_SNFC_GID16,         DMACB_SNFC_GID17, 
  *   DMACB_SNFC_GID18,         DMACB_SNFC_GID21,         DMACB_SNFC_GID22, 
  *   DMACB_SNFC_GID23,         DMACB_SNFC_GID24,         DMACB_SNFC_GID25, 
  *   DMACB_SNFC_GID26,         DMACB_SNFC_GID27,         DMACB_SNFC_GID28, 
  *   DMACB_ADC_COMPLETION,     DMACB_SSP0_RX,            DMACB_SSP0_TX,    
  *   DMACB_SSP1_RX,            DMACB_SSP1_TX,            DMACB_SSP2_RX,    
  *   DMACB_SSP2_TX,            DMACB_DMAREQB   
  *
  *   For DMAC_UNIT_C:
  *   DMACC_SNFC_RD1,           DMACC_SNFC_RD2,           DMACC_SNFC_RD3,           
  *   DMACC_SNFC_RD4,           DMACC_SNFC_RD5,           DMACC_SNFC_RD6,           
  *   DMACC_SNFC_RD7,           DMACC_SNFC_RD8,           DMACC_AES_READ,           
  *   DMACC_AES_WRITE,          DMACC_SHA_WRITE,          DMACC_DMA_COMPLETION,     
  *   DMACC_I2C0_TX_RX,         DMACC_I2C1_TX_RX,         DMACC_I2C2_TX_RX,        
  *   DMACC_MTP0_CMP_MATCH0,    DMACC_MTP0_CMP_MATCH1,    DMACC_MTP1_CMP_MATCH0,    
  *   DMACC_MTP1_CMP_MATCH1,    DMACC_MTP2_CMP_MATCH0,    DMACC_MTP2_CMP_MATCH1,    
  *   DMACC_MTP3_CMP_MATCH0,    DMACC_MTP3_CMP_MATCH1,    DMACC_TMRB3_INPUT_CAP0,   
  *   DMACC_TMRB3_INPUT_CAP1,   DMACC_TMRB4_INPUT_CAP0,   DMACC_TMRB4_INPUT_CAP1,   
  *   DMACC_TMRB5_INPUT_CAP0,   DMACC_TMRB5_INPUT_CAP1,   DMACC_TMRB6_INPUT_CAP0,   
  *   DMACC_TMRB6_INPUT_CAP1,   DMACC_DMAREQC   
  * @retval The inverted mask setting.
  *   ENABLE  : The DMA channel mask is cleared, DMA request is enable(valid)
  *   DISABLE : The DMA channel is masked, DMA request is disable(invalid)
  */
FunctionalState DMAC_GetMask(TSB_DMA_TypeDef * DMACx, uint8_t Channel)
{
    uint32_t tmp = 0U;
    FunctionalState state = DISABLE;

    assert_param(IS_DMAC_CHANNEL_ALL(DMACx, Channel));

    /* Read DMAxChnlReqMaskSet<chnl_req_mask_set> */
    tmp = DMACx->CHNLREQMASKSET & (uint32_t) (0x01UL << ((uint32_t) Channel));
    if (tmp != 0U) {                  
        state = DISABLE;
    } else {                    
        state = ENABLE;
    }

    return state;
}

/**
  * @brief  Enable or disable the specified channel of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B, DMAC_UNIT_C
  * @param  Channel: Select channel.
  *   This parameter can be one of the following values:
  *   For DMAC_UNIT_A:
  *   DMACA_SNFC_PRD11,         DMACA_SNFC_PRD12,         DMACA_SNFC_PRD21,                   
  *   DMACA_SNFC_PRD22,         DMACA_ADC_COMPLETION,     DMACA_UART0_RX,  
  *   DMACA_UART0_TX,           DMACA_UART1_RX,           DMACA_UART1_TX,                     
  *   DMACA_SIO0_UART0_RX,      DMACA_SIO0_UART0_TX,      DMACA_SIO1_UART1_RX,                
  *   DMACA_SIO1_UART1_TX,      DMACA_SIO2_UART2_RX,      DMACA_SIO2_UART2_TX,                             
  *   DMACA_SIO3_UART3_RX,      DMACA_SIO3_UART3_TX,      DMACA_TMRB0_CMP_MATCH,
  *   DMACA_TMRB1_CMP_MATCH,    DMACA_TMRB2_CMP_MATCH,    DMACA_TMRB3_CMP_MATCH,
  *   DMACA_TMRB4_CMP_MATCH,    DMACA_TMRB5_CMP_MATCH,    DMACA_TMRB6_CMP_MATCH,
  *   DMACA_TMRB7_CMP_MATCH,    DMACA_TMRB0_INPUT_CAP0,   DMACA_TMRB0_INPUT_CAP1,
  *   DMACA_TMRB1_INPUT_CAP0,   DMACA_TMRB1_INPUT_CAP1,   DMACA_TMRB2_INPUT_CAP0,
  *   DMACA_TMRB2_INPUT_CAP1,   DMACA_DMAREQA    
  *
  *   For DMAC_UNIT_B:
  *   DMACB_SNFC_GIE1,          DMACB_SNFC_GIE2,          DMACB_SNFC_GIE3,  
  *   DMACB_SNFC_GIE4,          DMACB_SNFC_GIE5,          DMACB_SNFC_GIE6,  
  *   DMACB_SNFC_GIE7,          DMACB_SNFC_GIE8,          DMACB_SNFC_GID11, 
  *   DMACB_SNFC_GID12,         DMACB_SNFC_GID13,         DMACB_SNFC_GID14, 
  *   DMACB_SNFC_GID15,         DMACB_SNFC_GID16,         DMACB_SNFC_GID17, 
  *   DMACB_SNFC_GID18,         DMACB_SNFC_GID21,         DMACB_SNFC_GID22, 
  *   DMACB_SNFC_GID23,         DMACB_SNFC_GID24,         DMACB_SNFC_GID25, 
  *   DMACB_SNFC_GID26,         DMACB_SNFC_GID27,         DMACB_SNFC_GID28, 
  *   DMACB_ADC_COMPLETION,     DMACB_SSP0_RX,            DMACB_SSP0_TX,    
  *   DMACB_SSP1_RX,            DMACB_SSP1_TX,            DMACB_SSP2_RX,    
  *   DMACB_SSP2_TX,            DMACB_DMAREQB   
  *
  *   For DMAC_UNIT_C:
  *   DMACC_SNFC_RD1,           DMACC_SNFC_RD2,           DMACC_SNFC_RD3,           
  *   DMACC_SNFC_RD4,           DMACC_SNFC_RD5,           DMACC_SNFC_RD6,           
  *   DMACC_SNFC_RD7,           DMACC_SNFC_RD8,           DMACC_AES_READ,           
  *   DMACC_AES_WRITE,          DMACC_SHA_WRITE,          DMACC_DMA_COMPLETION,     
  *   DMACC_I2C0_TX_RX,         DMACC_I2C1_TX_RX,         DMACC_I2C2_TX_RX,        
  *   DMACC_MTP0_CMP_MATCH0,    DMACC_MTP0_CMP_MATCH1,    DMACC_MTP1_CMP_MATCH0,    
  *   DMACC_MTP1_CMP_MATCH1,    DMACC_MTP2_CMP_MATCH0,    DMACC_MTP2_CMP_MATCH1,    
  *   DMACC_MTP3_CMP_MATCH0,    DMACC_MTP3_CMP_MATCH1,    DMACC_TMRB3_INPUT_CAP0,   
  *   DMACC_TMRB3_INPUT_CAP1,   DMACC_TMRB4_INPUT_CAP0,   DMACC_TMRB4_INPUT_CAP1,   
  *   DMACC_TMRB5_INPUT_CAP0,   DMACC_TMRB5_INPUT_CAP1,   DMACC_TMRB6_INPUT_CAP0,   
  *   DMACC_TMRB6_INPUT_CAP1,   DMACC_DMAREQC   
  * @param  NewState: Enable or disable the DMA channel
  *   This parameter can be one of the following values:
  *   ENABLE  : The DMA channel will be enabled
  *   DISABLE : The DMA channel will be disabled
  * @retval None
  */
void DMAC_SetChannel(TSB_DMA_TypeDef * DMACx, uint8_t Channel, FunctionalState NewState)
{
    uint32_t tmp = 0U;

    assert_param(IS_DMAC_CHANNEL_ALL(DMACx, Channel));
    assert_param(IS_FUNCTIONAL_STATE(NewState));

    if (NewState == ENABLE) {
        /* Set DMAxChnlEnableSet<chnl_enable_set> */
        tmp = DMACx->CHNLENABLESET;
        tmp |= (0x01UL << ((uint32_t) Channel));
        DMACx->CHNLENABLESET = tmp;
    } else {
        /* Set DMAxChnlEnableClr<chnl_enable_clr> */
        tmp = DMACx->CHNLENABLECLR;
        tmp |= (0x01UL << ((uint32_t) Channel));
        DMACx->CHNLENABLECLR = tmp;
    }
}

/**
  * @brief  Get the enable/disable setting for specified channel of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B, DMAC_UNIT_C
  * @param  Channel: Select channel.
  *   This parameter can be one of the following values:
  *   For DMAC_UNIT_A:
  *   DMACA_SNFC_PRD11,         DMACA_SNFC_PRD12,         DMACA_SNFC_PRD21,                   
  *   DMACA_SNFC_PRD22,         DMACA_ADC_COMPLETION,     DMACA_UART0_RX,  
  *   DMACA_UART0_TX,           DMACA_UART1_RX,           DMACA_UART1_TX,                     
  *   DMACA_SIO0_UART0_RX,      DMACA_SIO0_UART0_TX,      DMACA_SIO1_UART1_RX,                
  *   DMACA_SIO1_UART1_TX,      DMACA_SIO2_UART2_RX,      DMACA_SIO2_UART2_TX,                             
  *   DMACA_SIO3_UART3_RX,      DMACA_SIO3_UART3_TX,      DMACA_TMRB0_CMP_MATCH,
  *   DMACA_TMRB1_CMP_MATCH,    DMACA_TMRB2_CMP_MATCH,    DMACA_TMRB3_CMP_MATCH,
  *   DMACA_TMRB4_CMP_MATCH,    DMACA_TMRB5_CMP_MATCH,    DMACA_TMRB6_CMP_MATCH,
  *   DMACA_TMRB7_CMP_MATCH,    DMACA_TMRB0_INPUT_CAP0,   DMACA_TMRB0_INPUT_CAP1,
  *   DMACA_TMRB1_INPUT_CAP0,   DMACA_TMRB1_INPUT_CAP1,   DMACA_TMRB2_INPUT_CAP0,
  *   DMACA_TMRB2_INPUT_CAP1,   DMACA_DMAREQA    
  *
  *   For DMAC_UNIT_B:
  *   DMACB_SNFC_GIE1,          DMACB_SNFC_GIE2,          DMACB_SNFC_GIE3,  
  *   DMACB_SNFC_GIE4,          DMACB_SNFC_GIE5,          DMACB_SNFC_GIE6,  
  *   DMACB_SNFC_GIE7,          DMACB_SNFC_GIE8,          DMACB_SNFC_GID11, 
  *   DMACB_SNFC_GID12,         DMACB_SNFC_GID13,         DMACB_SNFC_GID14, 
  *   DMACB_SNFC_GID15,         DMACB_SNFC_GID16,         DMACB_SNFC_GID17, 
  *   DMACB_SNFC_GID18,         DMACB_SNFC_GID21,         DMACB_SNFC_GID22, 
  *   DMACB_SNFC_GID23,         DMACB_SNFC_GID24,         DMACB_SNFC_GID25, 
  *   DMACB_SNFC_GID26,         DMACB_SNFC_GID27,         DMACB_SNFC_GID28, 
  *   DMACB_ADC_COMPLETION,     DMACB_SSP0_RX,            DMACB_SSP0_TX,    
  *   DMACB_SSP1_RX,            DMACB_SSP1_TX,            DMACB_SSP2_RX,    
  *   DMACB_SSP2_TX,            DMACB_DMAREQB   
  *
  *   For DMAC_UNIT_C:
  *   DMACC_SNFC_RD1,           DMACC_SNFC_RD2,           DMACC_SNFC_RD3,           
  *   DMACC_SNFC_RD4,           DMACC_SNFC_RD5,           DMACC_SNFC_RD6,           
  *   DMACC_SNFC_RD7,           DMACC_SNFC_RD8,           DMACC_AES_READ,           
  *   DMACC_AES_WRITE,          DMACC_SHA_WRITE,          DMACC_DMA_COMPLETION,     
  *   DMACC_I2C0_TX_RX,         DMACC_I2C1_TX_RX,         DMACC_I2C2_TX_RX,        
  *   DMACC_MTP0_CMP_MATCH0,    DMACC_MTP0_CMP_MATCH1,    DMACC_MTP1_CMP_MATCH0,    
  *   DMACC_MTP1_CMP_MATCH1,    DMACC_MTP2_CMP_MATCH0,    DMACC_MTP2_CMP_MATCH1,    
  *   DMACC_MTP3_CMP_MATCH0,    DMACC_MTP3_CMP_MATCH1,    DMACC_TMRB3_INPUT_CAP0,   
  *   DMACC_TMRB3_INPUT_CAP1,   DMACC_TMRB4_INPUT_CAP0,   DMACC_TMRB4_INPUT_CAP1,   
  *   DMACC_TMRB5_INPUT_CAP0,   DMACC_TMRB5_INPUT_CAP1,   DMACC_TMRB6_INPUT_CAP0,   
  *   DMACC_TMRB6_INPUT_CAP1,   DMACC_DMAREQC   
  * @retval  The enable/disable setting for channel
  *   ENABLE  : The DMA channel is enabled
  *   DISABLE : The DMA channel is disabled  
  */
FunctionalState DMAC_GetChannelState(TSB_DMA_TypeDef * DMACx, uint8_t Channel)
{
    uint32_t tmp = 0U;
    FunctionalState state = DISABLE;

    assert_param(IS_DMAC_CHANNEL_ALL(DMACx, Channel));

    /* Read DMAxChnlEnableSet<chnl_enable_set> */
    tmp = DMACx->CHNLENABLESET & (uint32_t) (0x01UL << ((uint32_t) Channel));
    if (tmp != 0U) {                  
        state = ENABLE;
    } else {                    
        state = DISABLE;
    }
    
    return state;
}

/**
  * @brief  Set to use primary data or alternative data for specified channel of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B, DMAC_UNIT_C
  * @param  Channel: Select channel.
  *   This parameter can be one of the following values:
  *   For DMAC_UNIT_A:
  *   DMACA_SNFC_PRD11,         DMACA_SNFC_PRD12,         DMACA_SNFC_PRD21,                   
  *   DMACA_SNFC_PRD22,         DMACA_ADC_COMPLETION,     DMACA_UART0_RX,  
  *   DMACA_UART0_TX,           DMACA_UART1_RX,           DMACA_UART1_TX,                     
  *   DMACA_SIO0_UART0_RX,      DMACA_SIO0_UART0_TX,      DMACA_SIO1_UART1_RX,                
  *   DMACA_SIO1_UART1_TX,      DMACA_SIO2_UART2_RX,      DMACA_SIO2_UART2_TX,                             
  *   DMACA_SIO3_UART3_RX,      DMACA_SIO3_UART3_TX,      DMACA_TMRB0_CMP_MATCH,
  *   DMACA_TMRB1_CMP_MATCH,    DMACA_TMRB2_CMP_MATCH,    DMACA_TMRB3_CMP_MATCH,
  *   DMACA_TMRB4_CMP_MATCH,    DMACA_TMRB5_CMP_MATCH,    DMACA_TMRB6_CMP_MATCH,
  *   DMACA_TMRB7_CMP_MATCH,    DMACA_TMRB0_INPUT_CAP0,   DMACA_TMRB0_INPUT_CAP1,
  *   DMACA_TMRB1_INPUT_CAP0,   DMACA_TMRB1_INPUT_CAP1,   DMACA_TMRB2_INPUT_CAP0,
  *   DMACA_TMRB2_INPUT_CAP1,   DMACA_DMAREQA    
  *
  *   For DMAC_UNIT_B:
  *   DMACB_SNFC_GIE1,          DMACB_SNFC_GIE2,          DMACB_SNFC_GIE3,  
  *   DMACB_SNFC_GIE4,          DMACB_SNFC_GIE5,          DMACB_SNFC_GIE6,  
  *   DMACB_SNFC_GIE7,          DMACB_SNFC_GIE8,          DMACB_SNFC_GID11, 
  *   DMACB_SNFC_GID12,         DMACB_SNFC_GID13,         DMACB_SNFC_GID14, 
  *   DMACB_SNFC_GID15,         DMACB_SNFC_GID16,         DMACB_SNFC_GID17, 
  *   DMACB_SNFC_GID18,         DMACB_SNFC_GID21,         DMACB_SNFC_GID22, 
  *   DMACB_SNFC_GID23,         DMACB_SNFC_GID24,         DMACB_SNFC_GID25, 
  *   DMACB_SNFC_GID26,         DMACB_SNFC_GID27,         DMACB_SNFC_GID28, 
  *   DMACB_ADC_COMPLETION,     DMACB_SSP0_RX,            DMACB_SSP0_TX,    
  *   DMACB_SSP1_RX,            DMACB_SSP1_TX,            DMACB_SSP2_RX,    
  *   DMACB_SSP2_TX,            DMACB_DMAREQB   
  *
  *   For DMAC_UNIT_C:
  *   DMACC_SNFC_RD1,           DMACC_SNFC_RD2,           DMACC_SNFC_RD3,           
  *   DMACC_SNFC_RD4,           DMACC_SNFC_RD5,           DMACC_SNFC_RD6,           
  *   DMACC_SNFC_RD7,           DMACC_SNFC_RD8,           DMACC_AES_READ,           
  *   DMACC_AES_WRITE,          DMACC_SHA_WRITE,          DMACC_DMA_COMPLETION,     
  *   DMACC_I2C0_TX_RX,         DMACC_I2C1_TX_RX,         DMACC_I2C2_TX_RX,        
  *   DMACC_MTP0_CMP_MATCH0,    DMACC_MTP0_CMP_MATCH1,    DMACC_MTP1_CMP_MATCH0,    
  *   DMACC_MTP1_CMP_MATCH1,    DMACC_MTP2_CMP_MATCH0,    DMACC_MTP2_CMP_MATCH1,    
  *   DMACC_MTP3_CMP_MATCH0,    DMACC_MTP3_CMP_MATCH1,    DMACC_TMRB3_INPUT_CAP0,   
  *   DMACC_TMRB3_INPUT_CAP1,   DMACC_TMRB4_INPUT_CAP0,   DMACC_TMRB4_INPUT_CAP1,   
  *   DMACC_TMRB5_INPUT_CAP0,   DMACC_TMRB5_INPUT_CAP1,   DMACC_TMRB6_INPUT_CAP0,   
  *   DMACC_TMRB6_INPUT_CAP1,   DMACC_DMAREQC   
  * @param  PriAlt: Select primary data or alternative data for channel specified by 'Channel' above
  *   This parameter can be one of the following values:
  *   DMAC_PRIMARY   : Channel will use primary data
  *   DMAC_ALTERNATE : Channel will use alternative data
  * @retval None
  */
void DMAC_SetPrimaryAlt(TSB_DMA_TypeDef * DMACx, uint8_t Channel, DMAC_PrimaryAlt PriAlt)
{
    uint32_t tmp = 0U;

    assert_param(IS_DMAC_CHANNEL_ALL(DMACx, Channel));
    assert_param(IS_DMAC_PRIMARYALT(PriAlt));

