connorl309/Custom-UC-Board/tmpm46b_v2.3.1/tx03_cmsis_v2.3.1/M46B/TMPM46B/Libraries/TX04_Periph_Driver/src/tmpm46b_udmac.c
    if (Priority == DMAC_PRIORITY_NORMAL) {
        /* DMAC_PRIORITY_NORMAL: Set DMAxChnlPriorityClr<chnl_priority_clr> to clear */
        tmp = DMACx->CHNLPRIORITYCLR;
        tmp |= (0x01UL << ((uint32_t) Channel));
        DMACx->CHNLPRIORITYCLR = tmp;
    } else {
        /* DMAC_PRIORITY_HIGH: Set DMAxChnlPrioritySet<chnl_priority_set> */
        tmp = DMACx->CHNLPRIORITYSET;
        tmp |= (0x01UL << ((uint32_t) Channel));
        DMACx->CHNLPRIORITYSET = tmp;
    }
}

/**
  * @brief  Get the priority setting for specified channel of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B, DMAC_UNIT_C
  * @param  Channel: Select channel.
  *   This parameter can be one of the following values:
  *   For DMAC_UNIT_A:
  *   DMACA_SNFC_PRD11,         DMACA_SNFC_PRD12,         DMACA_SNFC_PRD21,                   
  *   DMACA_SNFC_PRD22,         DMACA_ADC_COMPLETION,     DMACA_UART0_RX,  
  *   DMACA_UART0_TX,           DMACA_UART1_RX,           DMACA_UART1_TX,                     
  *   DMACA_SIO0_UART0_RX,      DMACA_SIO0_UART0_TX,      DMACA_SIO1_UART1_RX,                
  *   DMACA_SIO1_UART1_TX,      DMACA_SIO2_UART2_RX,      DMACA_SIO2_UART2_TX,                             
  *   DMACA_SIO3_UART3_RX,      DMACA_SIO3_UART3_TX,      DMACA_TMRB0_CMP_MATCH,
  *   DMACA_TMRB1_CMP_MATCH,    DMACA_TMRB2_CMP_MATCH,    DMACA_TMRB3_CMP_MATCH,
  *   DMACA_TMRB4_CMP_MATCH,    DMACA_TMRB5_CMP_MATCH,    DMACA_TMRB6_CMP_MATCH,
  *   DMACA_TMRB7_CMP_MATCH,    DMACA_TMRB0_INPUT_CAP0,   DMACA_TMRB0_INPUT_CAP1,
  *   DMACA_TMRB1_INPUT_CAP0,   DMACA_TMRB1_INPUT_CAP1,   DMACA_TMRB2_INPUT_CAP0,
  *   DMACA_TMRB2_INPUT_CAP1,   DMACA_DMAREQA    
  *
  *   For DMAC_UNIT_B:
  *   DMACB_SNFC_GIE1,          DMACB_SNFC_GIE2,          DMACB_SNFC_GIE3,  
  *   DMACB_SNFC_GIE4,          DMACB_SNFC_GIE5,          DMACB_SNFC_GIE6,  
  *   DMACB_SNFC_GIE7,          DMACB_SNFC_GIE8,          DMACB_SNFC_GID11, 
  *   DMACB_SNFC_GID12,         DMACB_SNFC_GID13,         DMACB_SNFC_GID14, 
  *   DMACB_SNFC_GID15,         DMACB_SNFC_GID16,         DMACB_SNFC_GID17, 
  *   DMACB_SNFC_GID18,         DMACB_SNFC_GID21,         DMACB_SNFC_GID22, 
  *   DMACB_SNFC_GID23,         DMACB_SNFC_GID24,         DMACB_SNFC_GID25, 
  *   DMACB_SNFC_GID26,         DMACB_SNFC_GID27,         DMACB_SNFC_GID28, 
  *   DMACB_ADC_COMPLETION,     DMACB_SSP0_RX,            DMACB_SSP0_TX,    
  *   DMACB_SSP1_RX,            DMACB_SSP1_TX,            DMACB_SSP2_RX,    
  *   DMACB_SSP2_TX,            DMACB_DMAREQB   
  *
  *   For DMAC_UNIT_C:
  *   DMACC_SNFC_RD1,           DMACC_SNFC_RD2,           DMACC_SNFC_RD3,           
  *   DMACC_SNFC_RD4,           DMACC_SNFC_RD5,           DMACC_SNFC_RD6,           
  *   DMACC_SNFC_RD7,           DMACC_SNFC_RD8,           DMACC_AES_READ,           
  *   DMACC_AES_WRITE,          DMACC_SHA_WRITE,          DMACC_DMA_COMPLETION,     
  *   DMACC_I2C0_TX_RX,         DMACC_I2C1_TX_RX,         DMACC_I2C2_TX_RX,        
  *   DMACC_MTP0_CMP_MATCH0,    DMACC_MTP0_CMP_MATCH1,    DMACC_MTP1_CMP_MATCH0,    
  *   DMACC_MTP1_CMP_MATCH1,    DMACC_MTP2_CMP_MATCH0,    DMACC_MTP2_CMP_MATCH1,    
  *   DMACC_MTP3_CMP_MATCH0,    DMACC_MTP3_CMP_MATCH1,    DMACC_TMRB3_INPUT_CAP0,   
  *   DMACC_TMRB3_INPUT_CAP1,   DMACC_TMRB4_INPUT_CAP0,   DMACC_TMRB4_INPUT_CAP1,   
  *   DMACC_TMRB5_INPUT_CAP0,   DMACC_TMRB5_INPUT_CAP1,   DMACC_TMRB6_INPUT_CAP0,   
  *   DMACC_TMRB6_INPUT_CAP1,   DMACC_DMAREQC      
  * @retval  The priority setting of channel
  *   DMAC_PRIORITY_NORMAL : Normal priority
  *   DMAC_PRIORITY_HIGH   : High priority
  */
DMAC_Priority DMAC_GetChannelPriority(TSB_DMA_TypeDef * DMACx, uint8_t Channel)
{
    uint32_t tmp = 0U;
    DMAC_Priority Priority = DMAC_PRIORITY_NORMAL;

    assert_param(IS_DMAC_CHANNEL_ALL(DMACx, Channel));

    /* Read DMAxChnlPrioritySet<chnl_priority_set> */
    tmp = DMACx->CHNLPRIORITYSET & (uint32_t) (0x01UL << (uint32_t) Channel);
    if (tmp != 0U) {                  
        Priority = DMAC_PRIORITY_HIGH;
    } else {                    
        Priority = DMAC_PRIORITY_NORMAL;
    }
    
    return Priority;
}

/**
  * @brief  Clear the bus error of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B, DMAC_UNIT_C
  * @retval None
  */
void DMAC_ClearBusErr(TSB_DMA_TypeDef * DMACx)
{
    assert_param(IS_DMAC_UNIT(DMACx));

    /* Set DMAxErrClr<err_clr> */
    DMACx->ERRCLR = 0x00000001U;
}

/**
  * @brief  Get the bus error state of the specified DMAC unit.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B, DMAC_UNIT_C
  * @retval The bus error state
  *   SUCCESS :  No bus error
  *   ERROR   :  There is error in bus
  */
Result DMAC_GetBusErrState(TSB_DMA_TypeDef * DMACx)
{
    Result tmp = SUCCESS;
    
    assert_param(IS_DMAC_UNIT(DMACx));
    
    /* Read DMAxErrClr<err_clr> */
    if ((DMACx->ERRCLR & 0x00000001U) == 0x00000001U) {
        tmp = ERROR;
    } else {
        /* Do nothing */
    }
    
    return tmp;
}

/**
  * @brief  Fill the DMA setting data of specified channel of the specified DMAC unit to RAM.
  * @param  DMACx: Select DMAC unit.
  *   This parameter can be one of the following values:
  *   DMAC_UNIT_A, DMAC_UNIT_B, DMAC_UNIT_C
  * @param  Channel: Select channel.
  *   This parameter can be one of the following values:
  *   For DMAC_UNIT_A:
  *   DMACA_SNFC_PRD11,         DMACA_SNFC_PRD12,         DMACA_SNFC_PRD21,                   
  *   DMACA_SNFC_PRD22,         DMACA_ADC_COMPLETION,     DMACA_UART0_RX,  
  *   DMACA_UART0_TX,           DMACA_UART1_RX,           DMACA_UART1_TX,                     
  *   DMACA_SIO0_UART0_RX,      DMACA_SIO0_UART0_TX,      DMACA_SIO1_UART1_RX,                
  *   DMACA_SIO1_UART1_TX,      DMACA_SIO2_UART2_RX,      DMACA_SIO2_UART2_TX,                             
  *   DMACA_SIO3_UART3_RX,      DMACA_SIO3_UART3_TX,      DMACA_TMRB0_CMP_MATCH,
  *   DMACA_TMRB1_CMP_MATCH,    DMACA_TMRB2_CMP_MATCH,    DMACA_TMRB3_CMP_MATCH,
  *   DMACA_TMRB4_CMP_MATCH,    DMACA_TMRB5_CMP_MATCH,    DMACA_TMRB6_CMP_MATCH,
  *   DMACA_TMRB7_CMP_MATCH,    DMACA_TMRB0_INPUT_CAP0,   DMACA_TMRB0_INPUT_CAP1,
  *   DMACA_TMRB1_INPUT_CAP0,   DMACA_TMRB1_INPUT_CAP1,   DMACA_TMRB2_INPUT_CAP0,
  *   DMACA_TMRB2_INPUT_CAP1,   DMACA_DMAREQA    
  *
  *   For DMAC_UNIT_B:
  *   DMACB_SNFC_GIE1,          DMACB_SNFC_GIE2,          DMACB_SNFC_GIE3,  
  *   DMACB_SNFC_GIE4,          DMACB_SNFC_GIE5,          DMACB_SNFC_GIE6,  
  *   DMACB_SNFC_GIE7,          DMACB_SNFC_GIE8,          DMACB_SNFC_GID11, 
  *   DMACB_SNFC_GID12,         DMACB_SNFC_GID13,         DMACB_SNFC_GID14, 
  *   DMACB_SNFC_GID15,         DMACB_SNFC_GID16,         DMACB_SNFC_GID17, 
  *   DMACB_SNFC_GID18,         DMACB_SNFC_GID21,         DMACB_SNFC_GID22, 
  *   DMACB_SNFC_GID23,         DMACB_SNFC_GID24,         DMACB_SNFC_GID25, 
  *   DMACB_SNFC_GID26,         DMACB_SNFC_GID27,         DMACB_SNFC_GID28, 
  *   DMACB_ADC_COMPLETION,     DMACB_SSP0_RX,            DMACB_SSP0_TX,    
  *   DMACB_SSP1_RX,            DMACB_SSP1_TX,            DMACB_SSP2_RX,    
  *   DMACB_SSP2_TX,            DMACB_DMAREQB   
  *
  *   For DMAC_UNIT_C:
  *   DMACC_SNFC_RD1,           DMACC_SNFC_RD2,           DMACC_SNFC_RD3,           
  *   DMACC_SNFC_RD4,           DMACC_SNFC_RD5,           DMACC_SNFC_RD6,           
  *   DMACC_SNFC_RD7,           DMACC_SNFC_RD8,           DMACC_AES_READ,           
  *   DMACC_AES_WRITE,          DMACC_SHA_WRITE,          DMACC_DMA_COMPLETION,     
  *   DMACC_I2C0_TX_RX,         DMACC_I2C1_TX_RX,         DMACC_I2C2_TX_RX,        
  *   DMACC_MTP0_CMP_MATCH0,    DMACC_MTP0_CMP_MATCH1,    DMACC_MTP1_CMP_MATCH0,    
  *   DMACC_MTP1_CMP_MATCH1,    DMACC_MTP2_CMP_MATCH0,    DMACC_MTP2_CMP_MATCH1,    
  *   DMACC_MTP3_CMP_MATCH0,    DMACC_MTP3_CMP_MATCH1,    DMACC_TMRB3_INPUT_CAP0,   
  *   DMACC_TMRB3_INPUT_CAP1,   DMACC_TMRB4_INPUT_CAP0,   DMACC_TMRB4_INPUT_CAP1,   
  *   DMACC_TMRB5_INPUT_CAP0,   DMACC_TMRB5_INPUT_CAP1,   DMACC_TMRB6_INPUT_CAP0,   
  *   DMACC_TMRB6_INPUT_CAP1,   DMACC_DMAREQC            
  * @param  InitStruct: The structure contain the DMA setting values.
  * @retval None
  */
void DMAC_FillInitData(TSB_DMA_TypeDef * DMACx, uint8_t Channel, DMAC_InitTypeDef * InitStruct)
{
    DMAC_PrimaryAlt PriAlt = DMAC_PRIMARY;
    uint32_t Addr = 0U;
    uint32_t tmpCtrl = 0U;

    assert_param(IS_DMAC_CHANNEL_ALL(DMACx, Channel));

