connorl309/Custom-UC-Board/tmpm46b_v2.3.1/tx03_cmsis_v2.3.1/M46B/TMPM46B/Libraries/TX04_Periph_Driver/src/tmpm46b_udmac.c
    assert_param(IS_POINTER_NOT_NULL(InitStruct));

    assert_param(IS_DMAC_CYCLECTRL(InitStruct->Mode));
    assert_param(IS_DMAC_NEXT_USEBURST(InitStruct->NextUseBurst));
    assert_param(IS_DMAC_TXNUM(InitStruct->TxNum));
    assert_param(IS_DMAC_ARBITRATION(InitStruct->ArbitrationMoment));
    assert_param(IS_DMAC_BIT_WIDTH(InitStruct->SrcWidth));
    assert_param(IS_DMAC_INCWIDTH(InitStruct->SrcInc));
    assert_param(IS_DMAC_BIT_WIDTH(InitStruct->DstWidth));
    assert_param(IS_DMAC_INCWIDTH(InitStruct->DstInc));

    assert_param(IS_DMAC_INCWIDTH_VALID
                 ((uint32_t) InitStruct->SrcWidth, (uint32_t) InitStruct->SrcInc));
    assert_param(IS_DMAC_INCWIDTH_VALID
                 ((uint32_t) InitStruct->DstWidth, (uint32_t) InitStruct->DstInc));

    PriAlt = DMAC_GetPrimaryAlt(DMACx, Channel);

    if (PriAlt == DMAC_PRIMARY) {
        Addr = DMAC_GetBaseAddr(DMACx, DMAC_PRIMARY);
    } else {
        Addr = DMAC_GetBaseAddr(DMACx, DMAC_ALTERNATE);
    }

    /* Add offset for channel, each channel use (4 x uint32_t) RAM */
    Addr += (16U * (uint32_t) Channel);

    /* Make setting data for 'control data' */
    tmpCtrl |= (uint32_t) InitStruct->Mode;
    tmpCtrl |= ((uint32_t) InitStruct->NextUseBurst << 3U);
    tmpCtrl |= ((uint32_t) (InitStruct->TxNum - 1U) << 4U);
    tmpCtrl |= ((uint32_t) InitStruct->ArbitrationMoment << 14U);
    tmpCtrl |= ((uint32_t) InitStruct->SrcWidth << 24U);
    tmpCtrl |= ((uint32_t) InitStruct->SrcInc << 26U);
    tmpCtrl |= ((uint32_t) InitStruct->DstWidth << 28U);
    tmpCtrl |= ((uint32_t) InitStruct->DstInc << 30U);

    /* Write setting data to right address */
    *((uint32_t *) (Addr)) = InitStruct->SrcEndPointer;
    Addr += 4U;
    *((uint32_t *) (Addr)) = InitStruct->DstEndPointer;
    Addr += 4U;
    *((uint32_t *) (Addr)) = tmpCtrl;
    Addr += 4U;
    *((uint32_t *) (Addr)) = (uint32_t) 0U;
}

/**
  * @brief  Get the DMA factor flag of the DMAC UNITA.
  * @param  None
  * @retval A union with DMA factor flag of DMAC UNITA.
  */
DMACA_Flag DMACA_GetINTFlag(void)
{
    DMACA_Flag flag = { 0U };
    flag.All = TSB_DMAIF->FLGA;
    return flag;
}

/**
  * @brief  Get the DMA factor flag of the DMAC UNITB.
  * @param  None
  * @retval A union with DMA factor flag of DMAC UNITB.
  */
DMACB_Flag DMACB_GetINTFlag(void)
{
    DMACB_Flag flag = { 0U };
    flag.All = TSB_DMAIF->FLGB;
    return flag;
}

/**
  * @brief  Get the DMA factor flag of the DMAC UNITC.
  * @param  None
  * @retval A union with DMA factor flag of DMAC UNITC.
  */
DMACC_Flag DMACC_GetINTFlag(void)
{
    DMACC_Flag flag = { 0U };
    flag.All = TSB_DMAIF->FLGC;
    return flag;
}

/** @} */
/* End of group uDMAC_Exported_Functions */

/** @} */
/* End of group uDMAC */

/** @} */
/* End of group TX04_Periph_Driver */

#endif                          /* defined(__TMPM46B_uDMAC_H) */
